stars0628/MCU-Example/stm32f4_0.96OLED/stm32f4_0.96OLED_soft_spi/OLED_SOFT_SPI/oled.h
//oled.h

#ifndef __OLED_H
#define __OLED_H
			  	 
//========移植的时候，根据所选芯片引入相应的头文件==========，在main.h里面查看
#include "stm32f4xx_hal.h"
 	
//OLED模式设置
//0:4线串行模式
//1:并行8080模式
#define OLED_MODE 0
//#define SIZE 16
#define XLevelL		0x00
#define XLevelH		0x10
#define Max_Column	128
#define Max_Row		64
#define	Brightness	0xFF 
#define X_WIDTH 	128
#define Y_WIDTH 	64	  
  						  
//========移植的时候，根据引脚分配进行修改==========

//使用4线串行接口时使用 
#define OLED_RST_GPIO			GPIOC
#define OLED_RST_GPIO_PIN		GPIO_PIN_15
#define OLED_DC_GPIO			GPIOC
#define OLED_DC_GPIO_PIN		GPIO_PIN_0
#define OLED_SCLK_GPIO			GPIOC
#define OLED_SCLK_GPIO_PIN		GPIO_PIN_13
#define OLED_SDIN_GPIO			GPIOC
#define OLED_SDIN_GPIO_PIN		GPIO_PIN_14


//CS
#define OLED_CS_Clr()  //NOT USE
#define OLED_CS_Set()  //NOT USE

//RES
#define OLED_RST_Clr() HAL_GPIO_WritePin(OLED_RST_GPIO, OLED_RST_GPIO_PIN, GPIO_PIN_RESET)	//RES RES => 接RES（RST）引脚
#define OLED_RST_Set() HAL_GPIO_WritePin(OLED_RST_GPIO, OLED_RST_GPIO_PIN, GPIO_PIN_SET)

//DC
#define OLED_DC_Clr() HAL_GPIO_WritePin(OLED_DC_GPIO, OLED_DC_GPIO_PIN, GPIO_PIN_RESET)
#define OLED_DC_Set() HAL_GPIO_WritePin(OLED_DC_GPIO, OLED_DC_GPIO_PIN, GPIO_PIN_SET)

//SCLK,D0
#define OLED_SCLK_Clr() HAL_GPIO_WritePin(OLED_SCLK_GPIO, OLED_SCLK_GPIO_PIN, GPIO_PIN_RESET)
#define OLED_SCLK_Set() HAL_GPIO_WritePin(OLED_SCLK_GPIO, OLED_SCLK_GPIO_PIN, GPIO_PIN_SET)

//SDIN,D1
#define OLED_SDIN_Clr() HAL_GPIO_WritePin(OLED_SDIN_GPIO, OLED_SDIN_GPIO_PIN, GPIO_PIN_RESET)
#define OLED_SDIN_Set() HAL_GPIO_WritePin(OLED_SDIN_GPIO, OLED_SDIN_GPIO_PIN, GPIO_PIN_SET)

 		     
#define OLED_CMD  0	//写命令
#define OLED_DATA 1	//写数据


//OLED控制用函数
void OLED_WR_Byte(unsigned char dat,unsigned char cmd);	    
void OLED_Display_On(void);
void OLED_Display_Off(void);	   							   		    
void OLED_Init(void);
void OLED_Clear(void);
void OLED_DrawPoint(unsigned char x,unsigned char y,unsigned char t);
void OLED_Fill(unsigned char x1,unsigned char y1,unsigned char x2,unsigned char y2,unsigned char dot);
void OLED_ShowChar(unsigned char x,unsigned char y,unsigned char chr,unsigned char size,uint8_t Color_Turn);
void OLED_ShowNum(unsigned char x,unsigned char y,unsigned long num,unsigned char len,unsigned char size,uint8_t Color_Turn);
void OLED_ShowString(unsigned char x,unsigned char y, unsigned char *p,unsigned char size,uint8_t Color_Turn);	 
void OLED_Set_Pos(unsigned char x, unsigned char y);
void OLED_ShowCHinese(unsigned char x,unsigned char y,unsigned char no);
void OLED_DrawBMP(unsigned char x0, unsigned char y0,unsigned char x1, unsigned char y1,unsigned char BMP[]);
void OLED_ShowBNum(uint8_t x,uint8_t y,float num,uint8_t len,uint8_t size2,uint8_t Color_Turn);
void OLED_Cls(uint8_t y1);
#endif  
